using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*
                If…..
                C# Conditions and If Statements
                গণিতে ব্যবহৃত সাধারণ লজিক্যাল কন্ডিশন গুলি কে C# সাপোর্ট করে

                এর চেয়ে কম: a < b
                এর চেয়ে কম বা সমান: a <= b
                এর চেয়ে বেশি: a > b
                এর চেয়ে বেশি বা সমান: a >= b
                এর সমান: a == b
                এর সমান নয়: a != b
                এই কন্ডিশন গুলি ব্যবহার করে বিভিন্ন সিদ্ধান্তের জন্য বিভিন্ন কাজ সম্পাদন করা যায়।

                C# নিম্নলিখিত কন্ডিশনাল স্টেটমেন্টগুলি রয়েছে:

                1.  যদি একটি নির্দিষ্ট কন্ডিশন সত্য হয়, তাহলে কোডের একটি ব্লক কার্যকর করার জন্য if ব্যবহার করুন।
                2.  যদি একই কন্ডিশন মিথ্যা হয়, তাহলে কোডের একটি ব্লক কার্যকর করার জন্য else ব্যবহার করুন।
                3.  যদি প্রথম কন্ডিশন মিথ্যা হয়, তাহলে পরীক্ষা করার জন্য একটি নতুন কন্ডিশন নির্দিষ্ট করার জন্য else if ব্যবহার করুন।
                4.  কার্যকর করার জন্য অনেক গুলি বিকল্প কোড ব্লক নির্দিষ্ট করার জন্য switch ব্যবহার করুন।
                The if Statement
                যদি কোন শর্ত সত্য হয়, তাহলে কোন C# কোড ব্লক চালানোর জন্য if স্টেটমেন্ট ব্যবহার করুন।
                if (condition) 
                {
                  // block of code to be executed if the condition is True
                }
                মনে রাখবেন যে if ছোট হাতের অক্ষরে থাকে। বড় হাতের অক্ষর (যদি বা IF) একটি ত্রুটি তৈরি করবে।
                নিচের উদাহরণে, আমরা দুটি মান পরীক্ষা করি যাতে বুঝতে পারি যে ২০, ১৮ এর চেয়ে বড় কি না। if শর্তটি সত্য হয়, তাহলে কিছু টেক্সট প্রিন্ট করুন:

            */
            if (20 > 18)
            {
                Console.WriteLine("20 is greater than 18");
            }

                    //  আমরা ভ্যারিয়েবলও পরীক্ষা করতে পারি:
                    int x = 20;
                    int y = 18;
                    if (x > y)
                    {
                        Console.WriteLine("x is greater than y");
                    }

                    /*
                     উদাহরণ ব্যাখ্যা করা হলো
                     উপরের উদাহরণে আমরা দুটি ভেরিয়েবল, x এবং y, ব্যবহার করি x y এর চেয়ে বড় কিনা তা পরীক্ষা করার জন্য 
                     ( > অপারেটর ব্যবহার করে)। যেহেতু x হলো 20, এবং y হলো 18, এবং আমরা জানি যে 20 হলো 18 এর চেয়ে বড়,
                     আমরা স্ক্রিনে প্রিন্ট করি যে "x হলো y এর চেয়ে বড়"।
                    */

            Console.ReadLine();
        }
    }
}
